game-scenario-400.yml
config:
  target: "{{ $env.TARGET }}"
  phases:
    - duration: 20 # 테스트 시간
      arrivalRate: 10 # worker당 200명 (10 × 20s) — fargate --count으로 총 인원 조절
  processor: "processors.js"

scenarios:
  - name: "multi-worker players test"
    beforeScenario: "connectSocket"
    afterScenario: "disconnectSocket"
    flow:
      - function: 'setPlayerName'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'